# Используем официальный образ Node.js в качестве базового образа
FROM node:20-alpine3.17 

# Установим рабочую директорию в контейнере
WORKDIR /usr/src/app

# Скопируем package.json и package-lock.json для использования в Docker-контейнере
COPY package*.json ./

# Установим все необходимые пакеты, указанные в package.json, для работы приложения ВНУТРИ КОНТЕЙНЕРА
RUN npm install

# Скопируем исходный код приложения из нашего хоста (фактически . (точка) - означает текущую папку) в файловую систему Docker-контейнера.
COPY . .

# Наше приложение привязано  к порту 3000, поэтому используем инструкцию EXPOSE для его маппинга демоном Docker.
EXPOSE 3000

# Указываем какие команды использовать в команде для запуска приложения с помощью CMD, который определяет рабочее окружение 
# Docker-контейнера - фактически мы говорим после выполнения всех команд выполненных выше, в командной строке ВНУТРИ контейнера набери текст <npm start> и нажми ввод 
CMD [ "npm", "start" ]
